interface ArticleParagraph {
  paragraphTitle?: string;
  paragraphSubTitle?: string;
  imageSourceId?: string;
  text: string;
}

export interface Article {
  id: number;
  title: string;
  subTitle?: string;
  summary?: string;
  imageSourceId?: string;
  paragraphs: ArticleParagraph[];
  ps?: string;
}

export const ARTICLES: Article[] = [
  {
    id: 1,
    title: "Заголовок",
    subTitle: "Подзаголовок необязательный",
    summary:
      "Краткое содержание статьи - первые пару предложений ......... В самом общем виде астрологию невозможно фальсифицировать, но некоторые отдельные утверждения астрологов поддаются проверке",
    imageSourceId: "1ZVn3kSYa6IAe7XZiEJrWzd_SZLjdTre7",
    ps: "Астрологическая практика строится на двух тесно связанных моментах",
    paragraphs: [
      {
        text: "Астроло́гия (др.-греч. ἀστρολογία[1], от ἀστήρ, ἄστρον «звезда» и λόγος «мысль, причина») — разновидность гадательной магии[2], группа описательных и предсказательных практик, традиций и верований, постулирующих воздействие небесных тел на земной мир и человека (на его темперамент, характер, поступки и судьбу) и, в частности, возможность предсказания будущего по движению и расположению небесных тел на небесной сфере и относительно друг друга. Астрология противоречит научным данным и представляет собой антинаучное учение[",
      },
      {
        paragraphTitle: "Заголовок параграфа",
        text: "В связи с паранаучным характером астрологии не существует строгого общепринятого определения этой практики — этот вопрос по-разному решается в рамках множества астрологических школ и традиций. Широкие определения рассматривают астрологию как учение о связи человека и космоса и затрагивают различные понятия из астрономии, магии, эзотерики, психологии, оккультных, религиозных и философских концепций. Узкие определения сосредотачиваются на астрономической форме и магическом содержании астрологии и рассматривают её как, например, «математизированную технику составления гороскопов для предсказания по ним будущих событий». Астрологическая практика строится на двух тесно связанных моментах",
      },
      {
        paragraphTitle: "Заголовок параграфа",
        text: "Вопрос о времени и месте возникновения астрологии сложен, поскольку наука обладает лишь ограниченным кругом достоверных сведений о древнейших этапах развития человеческой культуры, а соответственно и ранней истории мифологии и наблюдательной астрономии. Некоторые исследователи относят возникновение астрологии к периоду мустьерской эпохи (около 40—100 тысяч лет назад), когда происходили фиксации простейших наблюдений за движением Солнца, а также развивались первоначальные навыки счёта и геометрия в разных районах Евразии[27].",
        imageSourceId: "1x_PNQLP21EezbGfm2bhKLrxLsXu3fHjn",
      },
      {
        paragraphTitle: "Заголовок параграфа",
        paragraphSubTitle: "Подзаголовок параграфа необязательный",
        text: "Основным методом астрологической деятельности является построение и интерпретация астрологических карт — схематических изображений расположения небесных тел в некоторый момент времени. Гороскоп — схематическая карта неба, видимого в определённый момент времени в некоторой географической точке земного шара. Астрологическая карта, отражающая схематическое расположение планет на небе, но не их расположение относительно горизонта, называется космограммой, то есть космограмма отражает относительное расположение тел Солнечной системы в определённый момент времени, но не их видимость с конкретной точки Земной поверхности. Используется для предсказания событий, связанных с этой точкой пространства и моментом времени; является основой многих традиций астрологии.      В гороскопе учитывается взаимное расположение небесных тел (см. аспект) и их положение относительно 12 знаков зодиака и 12 домов гороскопа. В западной астрологии новейшего времени для построения гороскопа, в зависимости от конкретной школы, к которой относит себя тот или иной астролог, кроме планет септенера (Солнца, Луны, Меркурия, Венеры, Марса, Юпитера, Сатурна), известных в древности, учитывается положение Урана, Нептуна, Плутона, некоторых крупных астероидов и фиктивных точек.",
      },
    ],
  },
  {
    id: 2,
    title: "Астрология - 2",
    subTitle: "Материал из Википедии — свободной энциклопедии. - 2",
    summary:
      "В самом общем виде астрологию невозможно фальсифицировать, но некоторые отдельные утверждения астрологов поддаются проверке[5]. Однако ни один эксперимент, который мог доказать истинность утверждений астрологии о связи событий на небе и на земле, не увенчался успехом.",
    imageSourceId: "1xdCIE8-TDoqVYIGkPvl2tCDf-gTBk5_L",
    ps: "Астрологическая практика строится на двух тесно связанных моментах",
    paragraphs: [
      {
        text: "Астроло́гия (др.-греч. ἀστρολογία[1], от ἀστήρ, ἄστρον «звезда» и λόγος «мысль, причина») — разновидность гадательной магии[2], группа описательных и предсказательных практик, традиций и верований, постулирующих воздействие небесных тел на земной мир и человека (на его темперамент, характер, поступки и судьбу) и, в частности, возможность предсказания будущего по движению и расположению небесных тел на небесной сфере и относительно друг друга. Астрология противоречит научным данным и представляет собой антинаучное учение[",
      },
      {
        paragraphTitle: "Заголовок параграфа",
        text: "В связи с паранаучным характером астрологии не существует строгого общепринятого определения этой практики — этот вопрос по-разному решается в рамках множества астрологических школ и традиций. Широкие определения рассматривают астрологию как учение о связи человека и космоса и затрагивают различные понятия из астрономии, магии, эзотерики, психологии, оккультных, религиозных и философских концепций. Узкие определения сосредотачиваются на астрономической форме и магическом содержании астрологии и рассматривают её как, например, «математизированную технику составления гороскопов для предсказания по ним будущих событий». Астрологическая практика строится на двух тесно связанных моментах",
      },
      {
        paragraphTitle: "Заголовок параграфа",
        text: "Вопрос о времени и месте возникновения астрологии сложен, поскольку наука обладает лишь ограниченным кругом достоверных сведений о древнейших этапах развития человеческой культуры, а соответственно и ранней истории мифологии и наблюдательной астрономии. Некоторые исследователи относят возникновение астрологии к периоду мустьерской эпохи (около 40—100 тысяч лет назад), когда происходили фиксации простейших наблюдений за движением Солнца, а также развивались первоначальные навыки счёта и геометрия в разных районах Евразии[27].",
        imageSourceId: "1x_PNQLP21EezbGfm2bhKLrxLsXu3fHjn",
      },
      {
        paragraphTitle: "Заголовок параграфа",
        paragraphSubTitle: "Подзаголовок параграфа необязательный",
        text: "Основным методом астрологической деятельности является построение и интерпретация астрологических карт — схематических изображений расположения небесных тел в некоторый момент времени. Гороскоп — схематическая карта неба, видимого в определённый момент времени в некоторой географической точке земного шара. Астрологическая карта, отражающая схематическое расположение планет на небе, но не их расположение относительно горизонта, называется космограммой, то есть космограмма отражает относительное расположение тел Солнечной системы в определённый момент времени, но не их видимость с конкретной точки Земной поверхности. Используется для предсказания событий, связанных с этой точкой пространства и моментом времени; является основой многих традиций астрологии.      В гороскопе учитывается взаимное расположение небесных тел (см. аспект) и их положение относительно 12 знаков зодиака и 12 домов гороскопа. В западной астрологии новейшего времени для построения гороскопа, в зависимости от конкретной школы, к которой относит себя тот или иной астролог, кроме планет септенера (Солнца, Луны, Меркурия, Венеры, Марса, Юпитера, Сатурна), известных в древности, учитывается положение Урана, Нептуна, Плутона, некоторых крупных астероидов и фиктивных точек.",
      },
    ],
  },
  {
    id: 3,
    title: "Астрология - 3",
    summary:
      "В самом общем виде астрологию невозможно фальсифицировать, но некоторые отдельные утверждения астрологов поддаются проверке[5]. Однако ни один эксперимент, который мог доказать истинность утверждений астрологии о связи событий на небе и на земле, не увенчался успехом.",
    imageSourceId: "1TwqGpoe_YjyEf8RTVH7P7ZfXcGycEePb",
    ps: "Астрологическая практика строится на двух тесно связанных моментах",
    paragraphs: [
      {
        text: "Астроло́гия (др.-греч. ἀστρολογία[1], от ἀστήρ, ἄστρον «звезда» и λόγος «мысль, причина») — разновидность гадательной магии[2], группа описательных и предсказательных практик, традиций и верований, постулирующих воздействие небесных тел на земной мир и человека (на его темперамент, характер, поступки и судьбу) и, в частности, возможность предсказания будущего по движению и расположению небесных тел на небесной сфере и относительно друг друга. Астрология противоречит научным данным и представляет собой антинаучное учение[",
      },
      {
        paragraphTitle: "Заголовок параграфа",
        text: "В связи с паранаучным характером астрологии не существует строгого общепринятого определения этой практики — этот вопрос по-разному решается в рамках множества астрологических школ и традиций. Широкие определения рассматривают астрологию как учение о связи человека и космоса и затрагивают различные понятия из астрономии, магии, эзотерики, психологии, оккультных, религиозных и философских концепций. Узкие определения сосредотачиваются на астрономической форме и магическом содержании астрологии и рассматривают её как, например, «математизированную технику составления гороскопов для предсказания по ним будущих событий». Астрологическая практика строится на двух тесно связанных моментах",
      },
      {
        paragraphTitle: "Заголовок параграфа",
        text: "Вопрос о времени и месте возникновения астрологии сложен, поскольку наука обладает лишь ограниченным кругом достоверных сведений о древнейших этапах развития человеческой культуры, а соответственно и ранней истории мифологии и наблюдательной астрономии. Некоторые исследователи относят возникновение астрологии к периоду мустьерской эпохи (около 40—100 тысяч лет назад), когда происходили фиксации простейших наблюдений за движением Солнца, а также развивались первоначальные навыки счёта и геометрия в разных районах Евразии[27].",
        imageSourceId: "1x_PNQLP21EezbGfm2bhKLrxLsXu3fHjn",
      },
      {
        paragraphTitle: "Заголовок параграфа",
        paragraphSubTitle: "Подзаголовок параграфа необязательный",
        text: "Основным методом астрологической деятельности является построение и интерпретация астрологических карт — схематических изображений расположения небесных тел в некоторый момент времени. Гороскоп — схематическая карта неба, видимого в определённый момент времени в некоторой географической точке земного шара. Астрологическая карта, отражающая схематическое расположение планет на небе, но не их расположение относительно горизонта, называется космограммой, то есть космограмма отражает относительное расположение тел Солнечной системы в определённый момент времени, но не их видимость с конкретной точки Земной поверхности. Используется для предсказания событий, связанных с этой точкой пространства и моментом времени; является основой многих традиций астрологии.      В гороскопе учитывается взаимное расположение небесных тел (см. аспект) и их положение относительно 12 знаков зодиака и 12 домов гороскопа. В западной астрологии новейшего времени для построения гороскопа, в зависимости от конкретной школы, к которой относит себя тот или иной астролог, кроме планет септенера (Солнца, Луны, Меркурия, Венеры, Марса, Юпитера, Сатурна), известных в древности, учитывается положение Урана, Нептуна, Плутона, некоторых крупных астероидов и фиктивных точек.",
      },
    ],
  },
];
