export type ColorVariant =
  | "purple-dark"
  | "purple-light"
  | "purple"
  | "white"
  | "pink"
  | "yellow"
  | "gray"
  | "red"
  | "green";

export const colorVariants: Record<ColorVariant, string> = {
  "purple-dark": "bg-purple-dark",
  "purple-light": "bg-purple-light",
  purple: "bg-purple",
  white: "bg-white",
  pink: "bg-pink",
  yellow: "bg-yellow",
  gray: "bg-gray",
  red: "bg-red",
  green: "bg-[#02C57E]",
};

export interface ParagraphList {
  listTitle: string;
  listItems: string[];
  numericList?: boolean;
}
export interface ArticleParagraph {
  paragraphTitle?: string;
  paragraphSubTitle?: string;
  imageSourceId?: string;
  text: string;
  list?: ParagraphList;
  backgroundColor?: ColorVariant;
}

export interface Article {
  id: number;
  title: string;
  subTitle?: string;
  summary?: string;
  imageSourceId?: string;
  paragraphs: ArticleParagraph[];
  ps?: string;
  status: "EXAMPLE" | "PUBLISHED";
}

export const ARTICLES: Article[] = [
  {
    status: "EXAMPLE",
    id: 99999999,
    title: "Заголовок статьи",
    subTitle: "Подзаголовок статьи необязательный",
    summary:
      "Краткое содержание статьи - первые пару предложений ......... В самом общем виде астрологию невозможно фальсифицировать, но некоторые отдельные утверждения астрологов поддаются проверке",
    imageSourceId: "1ZVn3kSYa6IAe7XZiEJrWzd_SZLjdTre7",
    ps: "Астрологическая практика строится на двух тесно связанных моментах",
    paragraphs: [
      {
        text: "Астроло́гия (др.-греч. ἀστρολογία[1], от ἀστήρ, ἄστρον «звезда» и λόγος «мысль, причина») — разновидность гадательной магии[2], группа описательных и предсказательных практик, традиций и верований, постулирующих воздействие небесных тел на земной мир и человека (на его темперамент, характер, поступки и судьбу) и, в частности, возможность предсказания будущего по движению и расположению небесных тел на небесной сфере и относительно друг друга. Астрология противоречит научным данным и представляет собой антинаучное учение[",
      },
      {
        paragraphTitle: "Заголовок параграфа (закрашенный фон, если надо)",
        backgroundColor: "pink",
        text: "В связи с паранаучным характером астрологии не существует строгого общепринятого определения этой практики — этот вопрос по-разному решается в рамках множества астрологических школ и традиций. Широкие определения рассматривают астрологию как учение о связи человека и космоса и затрагивают различные понятия из астрономии, магии, эзотерики, психологии, оккультных, религиозных и философских концепций. Узкие определения сосредотачиваются на астрономической форме и магическом содержании астрологии и рассматривают её как, например, «математизированную технику составления гороскопов для предсказания по ним будущих событий». Астрологическая практика строится на двух тесно связанных моментах",
      },
      {
        paragraphTitle: "Заголовок параграфа",
        text: "Вопрос о времени и месте возникновения астрологии сложен, поскольку наука обладает лишь ограниченным кругом достоверных сведений о древнейших этапах развития человеческой культуры, а соответственно и ранней истории мифологии и наблюдательной астрономии. Некоторые исследователи относят возникновение астрологии к периоду мустьерской эпохи (около 40—100 тысяч лет назад), когда происходили фиксации простейших наблюдений за движением Солнца, а также развивались первоначальные навыки счёта и геометрия в разных районах Евразии[27].",
        imageSourceId: "1x_PNQLP21EezbGfm2bhKLrxLsXu3fHjn",
      },
      {
        paragraphTitle: "Заголовок параграфа",
        paragraphSubTitle: "Подзаголовок параграфа необязательный",
        text: "Основным методом астрологической деятельности является построение и интерпретация астрологических карт — схематических изображений расположения небесных тел в некоторый момент времени. Гороскоп — схематическая карта неба, видимого в определённый момент времени в некоторой географической точке земного шара. Астрологическая карта, отражающая схематическое расположение планет на небе, но не их расположение относительно горизонта, называется космограммой, то есть космограмма отражает относительное расположение тел Солнечной системы в определённый момент времени, но не их видимость с конкретной точки Земной поверхности. Используется для предсказания событий, связанных с этой точкой пространства и моментом времени; является основой многих традиций астрологии.      В гороскопе учитывается взаимное расположение небесных тел (см. аспект) и их положение относительно 12 знаков зодиака и 12 домов гороскопа. В западной астрологии новейшего времени для построения гороскопа, в зависимости от конкретной школы, к которой относит себя тот или иной астролог, кроме планет септенера (Солнца, Луны, Меркурия, Венеры, Марса, Юпитера, Сатурна), известных в древности, учитывается положение Урана, Нептуна, Плутона, некоторых крупных астероидов и фиктивных точек.",
      },
      {
        text: "",
        backgroundColor: "gray",
        list: {
          numericList: false,
          listTitle:
            "Заголовок списка (ненумерованный, закрашенный фон если надо)",
          listItems: [
            "1 egg",
            "2 tbsp of vanilla yogurt",
            "1 tbsp of flax seed meal",
            "1 tbsp of all-purpose flour",
            "1 tbsp of quick-cooking oats",
            "1/2 tsp of baking powder",
            "2 tbsp of chopped walnuts",
            "1 tbsp of honey",
            "2 tsp of ground cinnamon",
          ],
        },
      },
      {
        text: "",
        list: {
          numericList: true,
          listTitle: "Заголовок списка (нумерованный)",
          listItems: [
            "Whisk the egg in a microwave-safe mug. ",
            "Stir in the walnuts, yogurt, flour, oats, flax, honey, cinnamon, and baking powder.",
            "Microwave until set (90–100 seconds). ",
            "Turn out onto a plate.",
          ],
        },
      },
    ],
  },
  {
    status: "PUBLISHED",
    id: 1,
    title: "Предсказывайте свое будущее благодаря Луне",
    summary:
      "Луна — это чувства, эмоции, женственность, детство, циклы, привычки, восприимчивость, внутренние биоритмы, точка комфорта, «люблю ли я жизнь?», «безопасно ли я себя чувствую?».",
    imageSourceId: "1xdCIE8-TDoqVYIGkPvl2tCDf-gTBk5_L",

    paragraphs: [
      {
        text: "Луна — это чувства, эмоции, женственность, детство, циклы, привычки, восприимчивость, внутренние биоритмы, точка комфорта, «люблю ли я жизнь?», «безопасно ли я себя чувствую?».",
      },
      {
        text: "Луна — это магия. Это самая важная точка в натальной карте. С нее все начинается и все заканчивается. Это наши очки, через которые мы воспринимаем окружающий мир.",
      },
      {
        text: "Для создания жизни своей мечты, для воплощения своих заветных желаний необходимо, в первую очередь, использовать лунные циклы. Начинайте процесс воплощения мечты в новолуние. Необходимо научиться работать с практиками, которые следует проводить в новолуние и полнолуние, о которых я  расскажу дальше. Благодаря им можно влиять на свой собственный гороскоп. Если наблюдать за движениями луны по натальной карте, можно прийти в согласие с ее ритмами и циклами, создать связь со Вселенной, от которой мы сейчас оторваны.",
      },
      {
        text: "Мы гораздо больше, чем просто люди, которые спешат каждое утро по делам. Мы — одно целое со Вселенной.",
        backgroundColor: "gray",
      },
      {
        paragraphTitle:
          "Меняйте свою жизнью в соответствии с лунными фазами и циклами",
        text: "Луна меняется постоянно и часто, и мы должны все время подвергать свою жизнь такой же динамике.",
      },
      {
        paragraphSubTitle: "Итак, Новолуние:",
        text: "следует начинать с чистого листа, мечты, цели, планы. Это период, когда мы должны заявлять о своих мечтах и желаниях. В этот период к нам приходит много идей; либо есть планы, которые мы не выполнили за предыдущий лунный месяц.  Наша задача - отсеять ненужные и думать только о том, что вы действительно хотите осуществить. Нам нужно высказать вселенной наши планы на будущее.",
      },
      {
        text: "Период Новолуния: с 1 по 3 лунный день.",
      },
      {
        text: "Затем наступает фаза растущей луны (с 3 по 7 лунный день).",
      },
      {
        text: "Это период, когда мы должны стартовать, рваться вперед по направлению наших целей. Думайте и визуализируйте  о тех желаниях, которые вы записали на новолуние.",
      },
      {
        paragraphSubTitle: "Первая четверть луны:",
        text: "с 7 по 10 лунный день. Самое время удвоить усилия в осуществлении своего желания. В этот период возможны противоречивые чувства, такие как сомнения в реализации цели. Не останавливайтесь, если уверены в своих намерениях.",
      },
      {
        paragraphSubTitle: "Период Горбатой луны:",
        text: "с 10 по 15 лунный день. Не сходите с дистанции, будьте стойкими, добавьте какие-то изменения в свою мечту, проанализируйте со стороны свои желания.",
      },
      {
        text: "И вот мы дошди до пика — Полнолуние, длится с 15 по 18 лунный день. Это кульминация лунного цикла, завершение, результат; то, чего мы достигли. Это время, когда необходимо оглянуться и посмотреть, что реализовалось из наших желаний, а к чему необходимо приложить больше усилий.",
      },
      {
        paragraphSubTitle: "Период Рассеивающей луны:",
        text: "следующая фаза за полнолунием. Это период с 18 по 21 лунный день. Это некоторый эмоциональный спад, период расслабления, не нужно начинать что-то новое. Это благоприятное время посмотреть, чему вы научились, какую мудрость приобрели; время, чтобы делиться этими знаниями с окружающими.",
      },
      {
        paragraphSubTitle: "Третья четверть луны:",
        text: "с 21 по 24 лунный день. Это сложный период переоценки. Это время, когда вы благополучно можете избавляться от вредных привычек. Когда в голову приходят новые идеи, планы, которые можно будет закладывать в предстоящее новолуние.",
      },
      {
        paragraphSubTitle: "И последняя фаза - Бальзамическая луна.",
        text: "Это период с 24 лунного дня и до новолуния. В это время мы осознаем, что возможно, а что было очень тяжело осуществить. Отпускайте обиды.  И это самое  благоприятное время для посещения парикмахера.",
      },
      {
        text: "Существует понятие «Луна без курса». Это когда луна на небе не делает ни одного аспекта ни с одной планетой. Соответственно, в этот период не нужно начинать новых дел, они могут не иметь продолжения, а силы вы потратите огромные. ",
        backgroundColor: "gray",
      },
      {
        paragraphTitle: "Как правильно загадывать желания?",
        text: "Секрет того, чтобы в жизни все получалось так, как хочется нам, заключается в нашем желании получения мечты. Не имейте ни малейшей доли сомнения",
      },
      {
        text: "Загадываем обязательно в новолуние. Зажгите свечу и включите приятную музыку.",
      },
      {
        text: "1. Возьмите лист бумаги и пропишите 10 желаний, а еще лучше нарисуйте их. Для воплощения своих целей недостаточно просто проговаривать их про себя. Научитесь разговаривать со Вселенной с помощью символов.",
      },
      {
        text: "Итак, вы нарисовали свои желания. А теперь просмотрите каждое из них и попробуйте подумать, что необходимо сделать (хотя бы одно действие) для их реализации. Это и есть намерение. Ведь мечта без намерения — это просто аффирмация, и она не работает, если мы просто сидим на месте.",
      },
      {
        text: "Самое важное при загадывании желания — постарайтесь прочувствовать те ощущения, которые вы получите при обладании своей мечтой; как будто бы желаемое уже осуществилось. Если ваша мечта — машина, то представьте свои ощущения и чувства, которые вам доставляет просто сидеть в салоне. Представляйте, какая марка авто будет, визуализируйте то, что вдохновляет вас. И не забывайте как можно чаще проговаривать: «Я люблю свою потрясающую машину!». Не думайте о том, какие препятствия могут быть на вашем пути к мечте; думайте о том, чего вы хотите. Загадывайте не материальное, а ощущения.",
      },
      {
        text: "Когда мы отчетливо понимаем, чего мы желаем, это упрощает исполнение желания.",
      },
      {
        text: "Не привязывайтесь слишком к своим желаниям, загадали и отпустили.",
        backgroundColor: "yellow",
      },
      {
        text: "2. Подумайте о людях, которым вы благодарны, и мысленно пошлите любовь всем тем, кто сделал вас счастливыми в предыдущий месяц.",
      },
      {
        text: "3. Просмотрите еще раз свои желания из списка желаний и поставьте каждому оценку от 1 до 10 баллов в зависимости от вероятности его осуществления. То желание, которое заслужило самой низкой отметки, - присмотритесь к нему повнимательнее и подумайте, какие дополнительные усилия необходимо приложить для их реализации. Запишите, что вы намерены сделать для исполнения каждого желания.",
      },
      {
        text: "4. Отпустите желания в пространство, проговорив фразу: «На благо всех или никак». И сожгите список - тем самым вы убираете привязанность к своим желаниям и отпускаете их в пространство.",
      },
      {
        text: "5. В следующее новолуние посмотрите на список выше и проанализируйте: все ли сбылось, и чего не хватило с вашей стороны для реализации желаний.",
      },
    ],

    ps: "Используйте новолуние как жизненный справочник на будущее. Предсказывайте свое будущее в новолуние. Ведь зная, в каком знаке оно будет происходить, и в какой доме вашей натальной карты, вы можете спрогнозировать и спроектировать ту сферу своей жизни, которая требует обновления.",
  },
];
